# -*- coding: utf-8 -*-
import re
from transformers import pipeline

# 불용어 리스트를 불러오는 함수
def load_stopwords(filepath):
    with open(filepath, 'r', encoding='utf-8') as file:
        stopwords = file.readlines()
        stopwords = [line.strip() for line in stopwords]
    return stopwords

# 텍스트 전처리 함수
def preprocess_text(text, stopwords):
    # 한글, 영문자, 숫자를 제외한 모든 문자를 제거
    text = re.sub(r'[^\w\s가-힣]', '', text)
    # 불용어 제거
    text = ' '.join(word for word in text.split() if word.lower() not in stopwords)
    return text

# 요약 파이프라인 로드
summarizer = pipeline("summarization", model="t5-small")

# 불용어 리스트 불러오기
stopwords = load_stopwords("korean_stopwords.txt")

# 요약할 텍스트입니다. 여기에 실제 요약하고 싶은 텍스트를 넣습니다.
text = """
[서울=뉴시스] 김경택 기자 = 경영권 분쟁 등 논란이 예상되는 주주총회도 다수 대기 중이다. 1·2대주주가 지분 경쟁을 벌이며 분쟁에 휩싸인 기업들이 있는가 하면 오너일가 등 가족 간 표 대결을 예고한 기업도 있어 주목되고 있다.

8일 금융투자업계에 따르면 다올투자증권 최대주주인 이병철 다올금융그룹 회장과 2대주주인 김기수 프레스토자문 대표의 경영권 갈등이 오는 15일 정기 주주총회에서 판가름날 전망이다.

이른바 '슈퍼개미'로 불리는 김기수 대표는 지난해 주식 보유 목적을 '일반 투자'에서 '경영권 영향'으로 변경하고 경영 참여를 선언한 인물이다.

앞서 김 대표는 12건의 주주제안을 냈다. ▲이사 임기 단축 ▲이사 보수한도 축소 ▲차등 배당 등을 회사에 요구했다. 특히 김 대표는 2대주주로서 주주가치 제고와 책임 경영을 위해 회사 최대주주와 함께 배당을 받지 않겠다고 밝히며 소액주주들에게 손을 내밀었다.

결과는 예단하기 어렵다. 최대주주와 2대주주간 지분율 차이가 크지 않기 때문이다. 지난해 말 기준 이 회장 측이 보유한 지분은 특수관계자를 포함해 25.19%다. 14.34%를 보유한 김 대표 측 지분과의 차이가 11%포인트 수준인 셈이다. 결국 60%에 달하는 소액주주의 표심이 향배를 가를 전망이다.

고려아연은 창업자 일가 간 경영권 분쟁이 불거진 상태다. 오는 19일 주총서 정관 개정과 배당 규모 등을 놓고 표 대결을 벌일 전망이다.

이번 표 대결은 오랜 기간 동업 관계를 이어온 영풍 장씨 일가와 고려아연 최씨 일가의 지분 경쟁이 주 배경이다. 영풍그룹 핵심 계열사 고려아연은 고(故) 장병희·최기호 창업주가 세운 회사로, 현재 고려아연은 최씨가, 영풍과 전자 계열사는 장씨가 각각 경영하고 있다.

특히 고려아연은 경영은 최씨 일가가 맡고 있지만 지분은 영풍 장씨 일가가 더 많았는데, 최근 최윤범 고려아연 회장 측이 현대차와 한화 등을 우군으로 끌어들이며 지분율을 높이고 있다. 이에 장씨 측도 지분 추가 매수에 나서고 있지만 현재 최 회장 측이 33%, 장씨 측이 32%로 역전된 것으로 분석된다. 격차가 1%포인트 안팎으로 크지 않은 만큼, 주총 전까지 일반 주주들을 상대로 여론전에 나설 것으로 예상된다.

한미약품그룹은 오너일가 간 다툼이 벌어지고 있다. 장·차남 연합과 모친·장녀 연합 간 대립이 이어지고 있다.

앞서 한미그룹의 지주회사 한미사이언스는 지난 1월12일 소재·에너지 기업 OCI그룹과 현물출자·신주발행 취득 등을 통한 통합 계약을 체결했다. OCI홀딩스가 한미사이언스 지분 27%를 7703억원에 취득하고, 임주현 사장 등 한미사이언스 주요 주주는 OCI홀딩스 지분 10.4%를 취득하는 내용이다.

이 과정에서 한미사이언스 이사회에 소속되지 않아 통합 결정에 참여하지 못한 장·차남 임종윤·종훈 한미약품 사장은 해당 계약에 반대하는 가처분 신청을 제기했다. 그러면서 한미사이언스 대표에 임종훈 사장이, 한미약품 대표에 임종윤 사장이 각자 대표이사로 경영에 복귀하겠다는 의사도 밝혔다.

이를 위해 이달 개최 예정인 한미사이언스의 정기 주총에서 임종윤, 임종훈 두 명과 두 사람이 지정한 4명의 후보자 등 총 6명이 한미사이언스의 새로운 이사로 선임될 수 있도록 주총 안건으로 상정해 달라는 내용의 주주 제안권을 행사했다.

현재 두 형제와 그 배우자·자녀 지분을 모두 합치면 28.4%다. 이 지분은 OCI 통합을 이끈 모친 송영숙 한미약품그룹 회장과 그 특수관계인의 지분 31.9%과 큰 차이가 없다.
"""

# 텍스트 전처리 수행
preprocessed_text = preprocess_text(text, stopwords)

# 텍스트 요약을 수행합니다.
summary = summarizer(text, max_length=130, min_length=30, do_sample=False)

# 요약 결과를 출력합니다.
print(summary[0]['summary_text'])
