-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: stocker
-- ------------------------------------------------------
-- Server version	8.0.35

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `company`
--

DROP TABLE IF EXISTS `company`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `company` (
  `company_id` int NOT NULL AUTO_INCREMENT,
  `code` int DEFAULT NULL,
  `company_name` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`company_id`)
) ENGINE=InnoDB AUTO_INCREMENT=201 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `company`
--

LOCK TABLES `company` WRITE;
/*!40000 ALTER TABLE `company` DISABLE KEYS */;
INSERT INTO `company` VALUES (1,5930,'삼성전자'),(2,660,'SK하이닉스'),(3,373220,'LG에너지솔루션'),(4,207940,'삼성바이오로직스'),(5,270,'기아'),(6,5380,'현대차'),(7,68270,'셀트리온'),(8,5490,'POSCO홀딩스'),(9,51910,'LG화학'),(10,6400,'삼성SDI'),(11,35420,'NAVER'),(12,105560,'KB금융'),(13,28260,'삼성물산'),(14,55550,'신한지주'),(15,12330,'현대모비스'),(16,3670,'포스코퓨처엠'),(17,35720,'카카오'),(18,32830,'삼성생명'),(19,86790,'하나금융지주'),(20,138040,'메리츠금융지주'),(21,66570,'LG전자'),(22,15760,'한국전력'),(23,810,'삼성화재'),(24,3550,'LG'),(25,34730,'SK'),(26,323410,'카카오뱅크'),(27,18260,'삼성에스디에스'),(28,96770,'SK이노베이션'),(29,24110,'기업은행'),(30,33780,'KT&G'),(31,17670,'SK텔레콤'),(32,259960,'크래프톤'),(33,34020,'두산에너빌리티'),(34,316140,'우리금융지주'),(35,11200,'HMM'),(36,9150,'삼성전기'),(37,329180,'HD현대중공업'),(38,450080,'에코프로머티'),(39,47050,'포스코인터내셔널'),(40,30200,'KT'),(41,402340,'SK스퀘어'),(42,10130,'고려아연'),(43,12450,'한화에어로스페이스'),(44,9540,'HD한국조선해양'),(45,42660,'한화오션'),(46,10950,'S-Oil'),(47,352820,'하이브'),(48,22100,'포스코DX'),(49,3490,'대한항공'),(50,10140,'삼성중공업'),(51,1570,'금양'),(52,326030,'SK바이오팜'),(53,5830,'DB손해보험'),(54,86280,'현대글로비스'),(55,90430,'아모레퍼시픽'),(56,161390,'한국타이어앤테크놀로지'),(57,100,'유한양행'),(58,267260,'HD현대일렉트릭'),(59,267250,'HD현대'),(60,51900,'LG생활건강'),(61,361610,'SK아이이테크놀로지'),(62,377300,'카카오페이'),(63,241560,'두산밥캣'),(64,11170,'롯데케미칼'),(65,251270,'넷마블'),(66,47810,'한국항공우주'),(67,28050,'삼성엔지니어링'),(68,302440,'SK바이오사이언스'),(69,9830,'한화솔루션'),(70,6800,'미래에셋증권'),(71,29780,'삼성카드'),(72,11790,'SKC'),(73,11070,'LG이노텍'),(74,78930,'GS'),(75,32640,'LG유플러스'),(76,4020,'현대제철'),(77,97950,'CJ제일제당'),(78,36570,'엔씨소프트'),(79,5940,'NH투자증권'),(80,128940,'한미약품'),(81,34220,'LG디스플레이'),(82,21240,'코웨이'),(83,11780,'금호석유'),(84,180640,'한진칼'),(85,71050,'한국금융지주'),(86,720,'현대건설'),(87,271560,'오리온'),(88,35250,'강원랜드'),(89,16360,'삼성증권'),(90,6260,'LS'),(91,79550,'LIG넥스원'),(92,39490,'키움증권'),(93,3410,'쌍용C&E'),(94,64350,'현대로템'),(95,272210,'한화시스템'),(96,18880,'한온시스템'),(97,1040,'CJ'),(98,4990,'롯데지주'),(99,1450,'현대해상'),(100,88350,'한화생명'),(101,8930,'한미사이언스'),(102,120,'CJ대한통운'),(103,383220,'F&F'),(104,36460,'한국가스공사'),(105,52690,'한전기술'),(106,10620,'현대미포조선'),(107,150,'두산'),(108,10120,'LS ELECTRIC'),(109,138930,'BNK금융지주'),(110,81660,'휠라홀딩스'),(111,2380,'KCC'),(112,175330,'JB금융지주'),(113,28670,'팬오션'),(114,4370,'농심'),(115,12750,'에스원'),(116,8770,'호텔신라'),(117,7070,'GS리테일'),(118,30000,'제일기획'),(119,112610,'씨에스윈드'),(120,282330,'BGF리테일'),(121,23530,'롯데쇼핑'),(122,2790,'아모레G'),(123,14680,'한솔케미칼'),(124,880,'한화'),(125,111770,'영원무역'),(126,139480,'이마트'),(127,20150,'롯데에너지머티리얼즈'),(128,9420,'한올바이오파마'),(129,10060,'OCI홀딩스'),(130,990,'DB하이텍'),(131,26960,'동서'),(132,42670,'HD현대인프라코어'),(133,4170,'신세계'),(134,73240,'금호타이어'),(135,2710,'TCC스틸'),(136,51600,'한전KPS'),(137,47040,'대우건설'),(138,17800,'현대엘리베이'),(139,145720,'덴티움'),(140,185750,'종근당'),(141,204320,'HL만도'),(142,298050,'효성첨단소재'),(143,240,'한국앤컴퍼니'),(144,1740,'SK네트웍스'),(145,3230,'삼양식품'),(146,3620,'KG모빌리티'),(147,5420,'코스모화학'),(148,5850,'에스엘'),(149,7310,'오뚜기'),(150,11210,'현대위아'),(151,139130,'DGB금융지주'),(152,80,'하이트진로'),(153,1440,'대한전선'),(154,6110,'삼아알미늄'),(155,6280,'녹십자'),(156,6360,'GS건설'),(157,14820,'동원시스템즈'),(158,69620,'대웅제약'),(159,103140,'풍산'),(160,137310,'에스디바이오센서'),(161,298020,'효성티앤씨'),(162,336260,'두산퓨얼셀'),(163,375500,'DL이앤씨'),(164,192820,'코스맥스'),(165,9970,'영원무역홀딩스'),(166,39130,'하나투어'),(167,9240,'한샘'),(168,280360,'롯데웰푸드'),(169,285130,'SK케미칼'),(170,69960,'현대백화점'),(171,4000,'롯데정밀화학'),(172,4490,'세방전지'),(173,4800,'효성'),(174,161890,'한국콜마'),(175,5300,'롯데칠성'),(176,3090,'대웅'),(177,10780,'아이에스동서'),(178,8730,'율촌화학'),(179,1800,'오리온홀딩스'),(180,1120,'LX인터내셔널'),(181,210,'DL'),(182,670,'영풍'),(183,271940,'일진하이솔루스'),(184,192080,'더블유게임즈'),(185,120110,'코오롱인더'),(186,9900,'명신산업'),(187,16380,'KG스틸'),(188,6650,'대한유화'),(189,93370,'후성'),(190,105630,'한세실업'),(191,114090,'GKL'),(192,300720,'한일시멘트'),(193,5250,'녹십자홀딩스'),(194,69260,'TKG휴켐스'),(195,20560,'아시아나항공'),(196,32350,'롯데관광개발'),(197,1430,'세아베스틸지주'),(198,1680,'대상'),(199,19170,'신풍제약'),(200,178920,'PI첨단소재');
/*!40000 ALTER TABLE `company` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-03-20 15:45:32
